## 19. 형식 변환


## 참고자료
* [Python 완전정복 시리즈] 2편 : Pandas DataFrame 완전정복 : https://wikidocs.net/book/7188

In [19]:
import pandas as pd
import numpy as np
import math

## csv으로 변환 (to_csv)

In [3]:
data = [[1,np.NaN],['A',4.1],['-','3']]
df = pd.DataFrame(data)
address = 'convert/'

In [4]:
df.to_csv(path_or_buf=address+'test1.csv')

In [5]:
df.to_csv(path_or_buf=address+'test2.csv', sep='-')

In [6]:
df.to_csv(path_or_buf=address+'test3.csv', na_rep=100)

In [7]:
df.to_csv(path_or_buf=address+'test4.csv', float_format='%.2f')

In [9]:
df.to_csv(path_or_buf=address+'test5.csv', columns=[0])

In [10]:
df.to_csv(path_or_buf=address+'test6.csv', header=['col1','col2'])

In [11]:
df.to_csv(path_or_buf=address+'test7.csv', index=False)

In [12]:
df.to_csv(path_or_buf=address+'test8.csv', index_label=['index'])

In [13]:
df.to_csv(path_or_buf=address+'test9.csv', mode='w') #기존 데이터 csv파일생성
df2 = pd.DataFrame(data=[[7,8],[9,10]],index=[3,4]) # 추가 입력할 새 데이터 객체 생성
df2.to_csv(path_or_buf=address+'test9.csv', mode='a') # mode=a로 기존데이터 아래에 추가함

In [14]:
df.to_csv(path_or_buf=address+'test10.csv', mode='w')
df2.to_csv(path_or_buf=address+'test10.csv', mode='a',header=False)

In [15]:
df.to_csv(path_or_buf=address+'test11.csv',quoting=2) # 숫자가 아닌 경우 인용구 처리

In [16]:
df.to_csv(path_or_buf=address+'test12.csv',quoting=2,quotechar="-")

In [17]:
df.to_csv(path_or_buf=address+'test13.csv',
          quoting=2,quotechar="-",doublequote=False,escapechar="$")

## excel으로 변환 (to_excel)

In [24]:
data1 = [[1,np.NaN],['A',4.1],[math.inf,'3']]
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data=[[5,6],[7,8],[9,10]],index=[['A','B','B'],[3,4,5]]) #멀티인덱스 객체

address = 'convert/'

In [21]:
df1

     0    1
0    1  NaN
1    A  4.1
2  inf    3

In [22]:
df2

     0   1
A 3  5   6
B 4  7   8
  5  9  10

In [26]:
df1.to_excel(excel_writer=address+'test1.xlsx')

In [28]:
df1.to_excel(excel_writer=address+'test2.xlsx',sheet_name='test_sheet')

In [30]:
with pd.ExcelWriter(address+'test3.xlsx') as writer:
    df1.to_excel(writer, sheet_name='test_sheet_1')
    df2.to_excel(writer, sheet_name='test_sheet_2')

In [31]:
df1.to_excel(excel_writer=address+'test4.xlsx',na_rep='BLANK')

In [33]:
df1.to_excel(excel_writer=address+'test6.xlsx',columns=[0])

In [34]:
df1.to_excel(excel_writer=address+'test7.xlsx',header=['col1','col2'])

In [35]:
df1.to_excel(excel_writer=address+'test8.xlsx', index=False)

In [36]:
df2.to_excel(excel_writer=address+'test9.xlsx', index_label=['idx1','idx2'])

In [37]:
df1.to_excel(excel_writer=address+'test10.xlsx', startrow=2,startcol=4)

In [38]:
df2.to_excel(excel_writer=address+'test11_1.xlsx')

In [39]:
df2.to_excel(excel_writer=address+'test11_2.xlsx', merge_cells=False)

In [41]:
df1.to_excel(excel_writer=address+'test12.xlsx', inf_rep='∞')

In [42]:
df1.to_excel(excel_writer=address+'test13.xlsx', freeze_panes=(1,1))

## 클립보드에 저장 (to_clipboard)

In [43]:
df = pd.DataFrame([[1,np.NaN],['A',4.1],[math.inf,'3']])
df

     0    1
0    1  NaN
1    A  4.1
2  inf    3

In [44]:
df.to_clipboard()

In [45]:
df.to_clipboard(excel=False)

In [47]:
df.to_clipboard(sep='-')

In [48]:
df.to_clipboard(header=['col1','col2'])

## dict로 변환 (to_dict)

In [49]:
df = pd.DataFrame([[1,2],[3,4]], columns=['col1','col2'],index=['row1','row2'])
df

      col1  col2
row1     1     2
row2     3     4

In [50]:
df.to_dict(orient='dict')

{'col1': {'row1': 1, 'row2': 3}, 'col2': {'row1': 2, 'row2': 4}}

In [51]:
df.to_dict(orient='list')

{'col1': [1, 3], 'col2': [2, 4]}

In [52]:
df.to_dict(orient='series')

{'col1': row1    1
 row2    3
 Name: col1, dtype: int64,
 'col2': row1    2
 row2    4
 Name: col2, dtype: int64}

In [53]:
df.to_dict(orient='split')

{'index': ['row1', 'row2'],
 'columns': ['col1', 'col2'],
 'data': [[1, 2], [3, 4]]}

In [54]:
df.to_dict(orient='records')

[{'col1': 1, 'col2': 2}, {'col1': 3, 'col2': 4}]

In [55]:
df.to_dict(orient='index')

{'row1': {'col1': 1, 'col2': 2}, 'row2': {'col1': 3, 'col2': 4}}

## Markdown으로 변환 (to_markdown)

In [57]:
df = pd.DataFrame([[1,2],[3,4]], columns=['col1','col2'],index=['row1','row2'])
df

      col1  col2
row1     1     2
row2     3     4

In [59]:
!pip3 install tabulate

Collecting tabulate
  Downloading tabulate-0.9.0-py3-none-any.whl (35 kB)
Installing collected packages: tabulate
Successfully installed tabulate-0.9.0

[notice] A new release of pip available: 22.2.2 -> 22.3.1
[notice] To update, run: python3.10 -m pip install --upgrade pip

In [60]:
df.to_markdown()

'|      |   col1 |   col2 |\n|:-----|-------:|-------:|\n| row1 |      1 |      2 |\n| row2 |      3 |      4 |'

In [61]:
df.to_markdown(index=False)

'|   col1 |   col2 |\n|-------:|-------:|\n|      1 |      2 |\n|      3 |      4 |'

In [63]:
df.to_markdown(tablefmt='fancy_grid')

'╒══════╤════════╤════════╕\n│      │   col1 │   col2 │\n╞══════╪════════╪════════╡\n│ row1 │      1 │      2 │\n├──────┼────────┼────────┤\n│ row2 │      3 │      4 │\n╘══════╧════════╧════════╛'

## pickle객체로 변환 (to_csv)

In [67]:
df = pd.DataFrame([[1,2],[3,4]], columns=['col1','col2'],index=['row1','row2'])
df

      col1  col2
row1     1     2
row2     3     4

In [68]:
df.to_pickle(address+'test1.pkl')

In [69]:
df2 = pd.read_pickle(address+'test1.pkl')
df2

      col1  col2
row1     1     2
row2     3     4

## html로 변환 (to_html)

In [70]:
data = [[1,np.NaN],['A',4.179],['<&>',32000]]
df = pd.DataFrame(data,columns=['col1','col2'])
df=df.rename_axis(columns='index')
df

index col1       col2
0        1        NaN
1        A      4.179
2      <&>  32000.000

In [71]:
df.to_html()

'<table border="1" class="dataframe">\n  <thead>\n    <tr style="text-align: right;">\n      <th>index</th>\n      <th>col1</th>\n      <th>col2</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>0</th>\n      <td>1</td>\n      <td>NaN</td>\n    </tr>\n    <tr>\n      <th>1</th>\n      <td>A</td>\n      <td>4.179</td>\n    </tr>\n    <tr>\n      <th>2</th>\n      <td>&lt;&amp;&gt;</td>\n      <td>32000.000</td>\n    </tr>\n  </tbody>\n</table>'

In [72]:
df.to_html(columns=['col1'])

'<table border="1" class="dataframe">\n  <thead>\n    <tr style="text-align: right;">\n      <th>index</th>\n      <th>col1</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>0</th>\n      <td>1</td>\n    </tr>\n    <tr>\n      <th>1</th>\n      <td>A</td>\n    </tr>\n    <tr>\n      <th>2</th>\n      <td>&lt;&amp;&gt;</td>\n    </tr>\n  </tbody>\n</table>'

In [73]:
df.to_html(col_space=[100,200])

'<table border="1" class="dataframe">\n  <thead>\n    <tr style="text-align: right;">\n      <th>index</th>\n      <th style="min-width: 100px;">col1</th>\n      <th style="min-width: 200px;">col2</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>0</th>\n      <td>1</td>\n      <td>NaN</td>\n    </tr>\n    <tr>\n      <th>1</th>\n      <td>A</td>\n      <td>4.179</td>\n    </tr>\n    <tr>\n      <th>2</th>\n      <td>&lt;&amp;&gt;</td>\n      <td>32000.000</td>\n    </tr>\n  </tbody>\n</table>'

In [74]:
df.to_html(header=False, index=False)

'<table border="1" class="dataframe">\n  <tbody>\n    <tr>\n      <td>1</td>\n      <td>NaN</td>\n    </tr>\n    <tr>\n      <td>A</td>\n      <td>4.179</td>\n    </tr>\n    <tr>\n      <td>&lt;&amp;&gt;</td>\n      <td>32000.000</td>\n    </tr>\n  </tbody>\n</table>'

In [75]:
df.to_html(na_rep="결측값")

'<table border="1" class="dataframe">\n  <thead>\n    <tr style="text-align: right;">\n      <th>index</th>\n      <th>col1</th>\n      <th>col2</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>0</th>\n      <td>1</td>\n      <td>결측값</td>\n    </tr>\n    <tr>\n      <th>1</th>\n      <td>A</td>\n      <td>4.179</td>\n    </tr>\n    <tr>\n      <th>2</th>\n      <td>&lt;&amp;&gt;</td>\n      <td>32000.000</td>\n    </tr>\n  </tbody>\n</table>'

In [76]:
time = pd.to_datetime(['16:04:33.500','17:30:00.000'],format='%H:%M:%S.%f')
x = pd.DataFrame({'col':time})
x

                      col
0 1900-01-01 16:04:33.500
1 1900-01-01 17:30:00.000

In [77]:
def format_func(x):
    return x.strftime('%H:%M')
result = x.to_html(formatters={'col':format_func})
result

'<table border="1" class="dataframe">\n  <thead>\n    <tr style="text-align: right;">\n      <th></th>\n      <th>col</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>0</th>\n      <td>16:04</td>\n    </tr>\n    <tr>\n      <th>1</th>\n      <td>17:30</td>\n    </tr>\n  </tbody>\n</table>'

In [79]:
df.to_html(float_format='{0:.2g}'.format)

'<table border="1" class="dataframe">\n  <thead>\n    <tr style="text-align: right;">\n      <th>index</th>\n      <th>col1</th>\n      <th>col2</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>0</th>\n      <td>1</td>\n      <td>NaN</td>\n    </tr>\n    <tr>\n      <th>1</th>\n      <td>A</td>\n      <td>4.2</td>\n    </tr>\n    <tr>\n      <th>2</th>\n      <td>&lt;&amp;&gt;</td>\n      <td>3.2e+04</td>\n    </tr>\n  </tbody>\n</table>'

In [81]:
df.to_html(index_names=False)

'<table border="1" class="dataframe">\n  <thead>\n    <tr style="text-align: right;">\n      <th></th>\n      <th>col1</th>\n      <th>col2</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>0</th>\n      <td>1</td>\n      <td>NaN</td>\n    </tr>\n    <tr>\n      <th>1</th>\n      <td>A</td>\n      <td>4.179</td>\n    </tr>\n    <tr>\n      <th>2</th>\n      <td>&lt;&amp;&gt;</td>\n      <td>32000.000</td>\n    </tr>\n  </tbody>\n</table>'

In [82]:
print('====='+'left'+'='*20) # 구분을 위해 입력한 값입니다.
print(df.to_html(col_space=[100,100], justify='left'))
print('====='+'right'+'='*20)
print(df.to_html(col_space=[100,100], justify='right'))
print('====='+'center'+'='*20)
print(df.to_html(col_space=[100,100], justify='center'))

=====left====================
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: left;">
      <th>index</th>
      <th style="min-width: 100px;">col1</th>
      <th style="min-width: 100px;">col2</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>1</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>1</th>
      <td>A</td>
      <td>4.179</td>
    </tr>
    <tr>
      <th>2</th>
      <td>&lt;&amp;&gt;</td>
      <td>32000.000</td>
    </tr>
  </tbody>
</table>
=====right====================
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th>index</th>
      <th style="min-width: 100px;">col1</th>
      <th style="min-width: 100px;">col2</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>1</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>1</th>
      <td>A</td>
      <td>4.179</td>
    </tr>
    <tr>
      <th>2</th>
      <td>&lt;&amp;&gt;</td>
      <td>32000.000</td>
    </tr>
  </tbody>
</table>
=====center====================
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: center;">
      <th>index</th>
      <th style="min-width: 100px;">col1</th>
      <th style="min-width: 100px;">col2</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>1</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>1</th>
      <td>A</td>
      <td>4.179</td>
    </tr>
    <tr>
      <th>2</th>
      <td>&lt;&amp;&gt;</td>
      <td>32000.000</td>
    </tr>
  </tbody>
</table>

In [101]:
df.to_html(max_rows=2)

'<table border="1" class="dataframe">\n  <thead>\n    <tr style="text-align: right;">\n      <th>index</th>\n      <th>col1</th>\n      <th>col2</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>0</th>\n      <td>1</td>\n      <td>NaN</td>\n    </tr>\n    <tr>\n      <th>...</th>\n      <td>...</td>\n      <td>...</td>\n    </tr>\n    <tr>\n      <th>2</th>\n      <td>&lt;&amp;&gt;</td>\n      <td>32000.0</td>\n    </tr>\n  </tbody>\n</table>'

In [102]:
df.to_html(max_cols=1)

'<table border="1" class="dataframe">\n  <thead>\n    <tr style="text-align: right;">\n      <th>index</th>\n      <th>col1</th>\n      <th>...</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>0</th>\n      <td>1</td>\n      <td>...</td>\n    </tr>\n    <tr>\n      <th>1</th>\n      <td>A</td>\n      <td>...</td>\n    </tr>\n    <tr>\n      <th>2</th>\n      <td>&lt;&amp;&gt;</td>\n      <td>...</td>\n    </tr>\n  </tbody>\n</table>'

In [103]:
df.to_html(show_dimensions=True)

'<table border="1" class="dataframe">\n  <thead>\n    <tr style="text-align: right;">\n      <th>index</th>\n      <th>col1</th>\n      <th>col2</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>0</th>\n      <td>1</td>\n      <td>NaN</td>\n    </tr>\n    <tr>\n      <th>1</th>\n      <td>A</td>\n      <td>4.179</td>\n    </tr>\n    <tr>\n      <th>2</th>\n      <td>&lt;&amp;&gt;</td>\n      <td>32000.000</td>\n    </tr>\n  </tbody>\n</table>\n<p>3 rows × 2 columns</p>'

In [104]:
df.to_html(decimal='_')

'<table border="1" class="dataframe">\n  <thead>\n    <tr style="text-align: right;">\n      <th>index</th>\n      <th>col1</th>\n      <th>col2</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>0</th>\n      <td>1</td>\n      <td>NaN</td>\n    </tr>\n    <tr>\n      <th>1</th>\n      <td>A</td>\n      <td>4_179</td>\n    </tr>\n    <tr>\n      <th>2</th>\n      <td>&lt;&amp;&gt;</td>\n      <td>32000_000</td>\n    </tr>\n  </tbody>\n</table>'

In [105]:
df.to_html(bold_rows=False)

'<table border="1" class="dataframe">\n  <thead>\n    <tr style="text-align: right;">\n      <th>index</th>\n      <th>col1</th>\n      <th>col2</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td>0</td>\n      <td>1</td>\n      <td>NaN</td>\n    </tr>\n    <tr>\n      <td>1</td>\n      <td>A</td>\n      <td>4.179</td>\n    </tr>\n    <tr>\n      <td>2</td>\n      <td>&lt;&amp;&gt;</td>\n      <td>32000.000</td>\n    </tr>\n  </tbody>\n</table>'

In [106]:
df.to_html(classes='test')

'<table border="1" class="dataframe test">\n  <thead>\n    <tr style="text-align: right;">\n      <th>index</th>\n      <th>col1</th>\n      <th>col2</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>0</th>\n      <td>1</td>\n      <td>NaN</td>\n    </tr>\n    <tr>\n      <th>1</th>\n      <td>A</td>\n      <td>4.179</td>\n    </tr>\n    <tr>\n      <th>2</th>\n      <td>&lt;&amp;&gt;</td>\n      <td>32000.000</td>\n    </tr>\n  </tbody>\n</table>'

In [107]:
df.to_html(escape=False)

'<table border="1" class="dataframe">\n  <thead>\n    <tr style="text-align: right;">\n      <th>index</th>\n      <th>col1</th>\n      <th>col2</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>0</th>\n      <td>1</td>\n      <td>NaN</td>\n    </tr>\n    <tr>\n      <th>1</th>\n      <td>A</td>\n      <td>4.179</td>\n    </tr>\n    <tr>\n      <th>2</th>\n      <td><&></td>\n      <td>32000.000</td>\n    </tr>\n  </tbody>\n</table>'

In [108]:
df.to_html(border=2)

'<table border="2" class="dataframe">\n  <thead>\n    <tr style="text-align: right;">\n      <th>index</th>\n      <th>col1</th>\n      <th>col2</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>0</th>\n      <td>1</td>\n      <td>NaN</td>\n    </tr>\n    <tr>\n      <th>1</th>\n      <td>A</td>\n      <td>4.179</td>\n    </tr>\n    <tr>\n      <th>2</th>\n      <td>&lt;&amp;&gt;</td>\n      <td>32000.000</td>\n    </tr>\n  </tbody>\n</table>'

In [109]:
df.to_html(table_id='test')

'<table border="1" class="dataframe" id="test">\n  <thead>\n    <tr style="text-align: right;">\n      <th>index</th>\n      <th>col1</th>\n      <th>col2</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>0</th>\n      <td>1</td>\n      <td>NaN</td>\n    </tr>\n    <tr>\n      <th>1</th>\n      <td>A</td>\n      <td>4.179</td>\n    </tr>\n    <tr>\n      <th>2</th>\n      <td>&lt;&amp;&gt;</td>\n      <td>32000.000</td>\n    </tr>\n  </tbody>\n</table>'

## string으로 변환 (to_string)

In [83]:
data = [[1,np.NaN],['A',4.179],['<&>',32000]]
df = pd.DataFrame(data,columns=['col1','col2'])
df=df.rename_axis(columns='index')
df

index col1       col2
0        1        NaN
1        A      4.179
2      <&>  32000.000

In [84]:
df.to_string()

'index col1       col2\n0        1        NaN\n1        A      4.179\n2      <&>  32000.000'

In [85]:
type(df)

pandas.core.frame.DataFrame

In [88]:
type(df.to_string())

str

In [89]:
df.to_string(columns=['col2'])

'index       col2\n0            NaN\n1          4.179\n2      32000.000'

In [90]:
df.to_string(col_space=[10,20])

'index       col1                 col2\n0              1                  NaN\n1              A                4.179\n2            <&>            32000.000'

In [91]:
df.to_string(header=['val1', 'val2'])

'index val1       val2\n0        1        NaN\n1        A      4.179\n2      <&>  32000.000'

In [92]:
df.to_string(index=False)

'col1      col2\n   1       NaN\n   A     4.179\n <&> 32000.000'

In [93]:
df.to_string(na_rep='결측')

'index col1       col2\n0        1         결측\n1        A      4.179\n2      <&>  32000.000'

In [94]:
df.to_string(justify='left')

'index col1  col2     \n0        1        NaN\n1        A      4.179\n2      <&>  32000.000'

In [95]:
df.to_string(max_rows=2)

'index col1     col2\n0        1      NaN\n..     ...      ...\n2      <&>  32000.0'

In [96]:
df.to_string(max_cols=1)

'index col1  ...\n0        1  ...\n1        A  ...\n2      <&>  ...'

In [97]:
df.to_string(show_dimensions=True)

'index col1       col2\n0        1        NaN\n1        A      4.179\n2      <&>  32000.000\n\n[3 rows x 2 columns]'

In [98]:
df.to_string(decimal='_')

'index col1       col2\n0        1        NaN\n1        A      4_179\n2      <&>  32000_000'

In [99]:
df.to_string(line_width=2)

'index col1  \\\n0        1   \n1        A   \n2      <&>   \n\nindex       col2  \n0            NaN  \n1          4.179  \n2      32000.000  '

In [100]:
df.to_string(max_colwidth=5)

'index col1  col2\n0        1   NaN\n1        A  4...\n2      <&>  3...'

## numpy로 변환 (values)

In [110]:
col1 = [1, 2, 3, 4]
col2 = ['one', 'two', 'three', 'four']
col3 = [1.5, 2.5, 3.5, 4.5]
col4 = [True, False, False, True]
index = ['row1','row2','row3','row4']
df = pd.DataFrame(index=index, data={"col1": col1, "col2": col2, "col3": col3, "col4": col4})
df

      col1   col2  col3   col4
row1     1    one   1.5   True
row2     2    two   2.5  False
row3     3  three   3.5  False
row4     4   four   4.5   True

In [111]:
df.values

array([[1, 'one', 1.5, True],
       [2, 'two', 2.5, False],
       [3, 'three', 3.5, False],
       [4, 'four', 4.5, True]], dtype=object)

## dict에서 변환 (from_dict)

##